DataProcessors/Рин1_API_Schneider.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<DataProcessor>
		<Properties>
			<Name>Рин1_API_Schneider</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глубина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЕдиницыУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ETIM_Класс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ETIM_Класс_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОбработаны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Прайс</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обновлено</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обновлено</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Гиперссылка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДействия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обновлено</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Изображения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Гиперссылка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ETIM</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ETIM_Свойство</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ETIM_Свойство_Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ETIM_Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ETIM_Значение_Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ETIM_ЗначениеИПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ETIM_Единица</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ETIM_Единица_Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/Рин1_API_Schneider/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Обновить(Команда) //обрабатываем только по номенклатуре или артикулу
	
	ОчиститьФорму();
	
	Если не ЗначениеЗаполнено(Объект.Номенклатура) и не ЗначениеЗаполнено(Объект.Артикул) Тогда
		Сообщить("Не заполнена номенклатура или артикул!");
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(Объект.Номенклатура) и ЗначениеЗаполнено(Объект.Артикул) Тогда  
		Сообщить("Запрос возможен только по номенклатуре или артикулу. Оставьте только одно!");
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(Объект.Номенклатура) и не ЗначениеЗаполнено(Объект.Артикул) Тогда   
		Если не ЗначениеЗаполнено(АртикулНоменклатуры()) Тогда
			Сообщить("Не заполнен артикул номенклатуры!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Сообщить("Данные запрашиваются, ожидайте!");
	ПолучитьЗапрашиваемыеДанные();
	
	Если Объект.ДанныеОбработаны Тогда
		//ОчиститьСообщения();
		WshShell = Новый COMObject("WScript.Shell");
		WshShell.SendKeys("^+z");   //имитируем нажатие
		WshShell.SendKeys("^+я");   //для случая, если текущей является русская раскладка клавиатуры
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОписание;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ОчиститьФорму();
	
	Если не ЗначениеЗаполнено(Объект.Номенклатура) и не ЗначениеЗаполнено(Объект.Артикул) Тогда
		Сообщить("Не заполнена номенклатура!");
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(Объект.Номенклатура) и ЗначениеЗаполнено(Объект.Артикул) Тогда  
		Сообщить("Запрос возможен только по номенклатуре или артикулу. Оставьте только одно!");
		Возврат;
	ИначеЕсли не ЗначениеЗаполнено(АртикулНоменклатуры()) Тогда
		Сообщить("Не заполнен артикул номенклатуры!");
		Возврат;
	КонецЕсли;
	
	Сообщить("Данные запрашиваются, ожидайте!");
	ПолучитьЗапрашиваемыеДанные();
	
	Если Объект.ДанныеОбработаны Тогда
		//ОчиститьСообщения();
		WshShell = Новый COMObject("WScript.Shell");
		WshShell.SendKeys("^+z");   //имитируем нажатие
		WshShell.SendKeys("^+я");   //для случая, если текущей является русская раскладка клавиатуры
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОписание;

КонецПроцедуры

&НаКлиенте
Процедура АртикулПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) и ЗначениеЗаполнено(Объект.Артикул) Тогда 
		Объект.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		//Сообщить("Запрос возможен только по номенклатуре или артикулу. Оставьте только одно!");
		//Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АртикулОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	//Объект.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
КонецПроцедуры

&НаСервере
Процедура ОчиститьФорму()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	
	ОбработкаОбъект.Изображения.Очистить();
	ОбработкаОбъект.Сертификаты.Очистить();
	ОбработкаОбъект.ETIM.Очистить();
	ОбработкаОбъект.Прайс.Очистить();
	ОбработкаОбъект.Остатки.Очистить();
	
	ОбработкаОбъект.Описание = "";
	
	ОбработкаОбъект.Вес = 0;
	ОбработкаОбъект.Глубина = 0;
	ОбработкаОбъект.Длина = 0;
	ОбработкаОбъект.КодЕдиницыУпаковки = "";
	ОбработкаОбъект.КоличествоМин = 0;
	ОбработкаОбъект.Объем = 0;
	ОбработкаОбъект.Ширина = 0;
	
	ОбработкаОбъект.ETIM_Класс = "";
	ОбработкаОбъект.ETIM_Класс_Представление = "";
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Функция АртикулНоменклатуры()
	
	Объект.Артикул = Объект.Номенклатура.Артикул;
	Возврат Объект.Номенклатура.Артикул;	
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если не Объект.Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
		ПолучитьЗапрашиваемыеДанные();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗапрашиваемыеДанные()
	
	//API SE
	СтруктураМетодовЗапроса = Новый Структура;
	СтруктураМетодовЗапроса.Вставить("getBasicData","new-api/XML/getbasicdata?commercialRef=");  //получим ОПИСАНИЕ,СЕРИЮ,ФОТО,УПАКОВКУ,ETIM
	СтруктураМетодовЗапроса.Вставить("getPrice","new-api/XML/getprice?commercialRef=");          //получим ЦЕНУ,
	СтруктураМетодовЗапроса.Вставить("getCert","new-api/XML/getcert?commercialRef=");            //получим СЕРТИФИКАТЫ,
	СтруктураМетодовЗапроса.Вставить("getStock","new-api/XML/getstock?commercialRef=");          //получим СКЛАДСКИЕ ОСТАТКИ,
	
	ОбъектВЗначении = РеквизитФормыВЗначение("Объект");
	ОбъектВЗначении.ВыполнитьЗапрос(СтруктураМетодовЗапроса);
	
	ЗначениеВРеквизитФормы(ОбъектВЗначении, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура СертификатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СертификатыГиперссылка" Тогда
		ЗапуститьПриложение(Элемент.ТекущиеДанные.Гиперссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзображенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ИзображенияГиперссылка" Тогда
		ЗапуститьПриложение(Элемент.ТекущиеДанные.Гиперссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Объект.Артикул = "";
КонецПроцедуры
